Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.rds.aws_db_instance.rds has been changed
~ resource "aws_db_instance" "rds" {
        id                                    = "comentarios-api-production-rds01"
      ~ latest_restorable_time                = "2021-08-09T08:10:00Z" -> "2021-08-09T08:30:00Z"
        name                                  = ""
        tags                                  = {
            "Environment" = "production"
            "Name"        = "comentarios-api-production-rds01"
            "Project"     = "comentarios-api"
        }
        # (56 unchanged attributes hidden)
    }
  # aws_api_gateway_stage.api has been changed
~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "3irwgl" -> "5ype87"
        id                    = "ags-n1fiynim17-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }
  # aws_lambda_function.main has been changed
~ resource "aws_lambda_function" "main" {
        id                             = "comentarios-api"
      ~ last_modified                  = "2021-08-09T08:12:15.672+0000" -> "2021-08-09T08:21:21.344+0000"
        tags                           = {}
        # (25 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_api_gateway_integration.integrationcommentlist1 will be created
+ resource "aws_api_gateway_integration" "integrationcommentlist1" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "n1fiynim17"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:107815129133:function:comentarios-api/invocations"
    }

  # aws_api_gateway_integration.integrationcommentlist2 will be created
+ resource "aws_api_gateway_integration" "integrationcommentlist2" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "n1fiynim17"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:107815129133:function:comentarios-api/invocations"
    }

  # aws_api_gateway_integration.integrationcommentnew1post will be created
+ resource "aws_api_gateway_integration" "integrationcommentnew1post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "n1fiynim17"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:107815129133:function:comentarios-api/invocations"
    }

  # aws_api_gateway_integration.integrationcommentnew2post will be created
+ resource "aws_api_gateway_integration" "integrationcommentnew2post" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "n1fiynim17"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = "arn:aws:apigateway:us-east-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-2:107815129133:function:comentarios-api/invocations"
    }

  # aws_api_gateway_method.commentlist1get will be created
+ resource "aws_api_gateway_method" "commentlist1get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "n1fiynim17"
    }

  # aws_api_gateway_method.commentlist2get will be created
+ resource "aws_api_gateway_method" "commentlist2get" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "n1fiynim17"
    }

  # aws_api_gateway_method.commentnew1post will be created
+ resource "aws_api_gateway_method" "commentnew1post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "n1fiynim17"
    }

  # aws_api_gateway_method.commentnew2post will be created
+ resource "aws_api_gateway_method" "commentnew2post" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "n1fiynim17"
    }

  # aws_api_gateway_resource.comment will be created
+ resource "aws_api_gateway_resource" "comment" {
      + id          = (known after apply)
      + parent_id   = "o5oj58rxu1"
      + path        = (known after apply)
      + path_part   = "comment"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentlist will be created
+ resource "aws_api_gateway_resource" "commentlist" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "list"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentlist1 will be created
+ resource "aws_api_gateway_resource" "commentlist1" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "1"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentlist2 will be created
+ resource "aws_api_gateway_resource" "commentlist2" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "2"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentnew will be created
+ resource "aws_api_gateway_resource" "commentnew" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "new"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentnew1 will be created
+ resource "aws_api_gateway_resource" "commentnew1" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "1"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_resource.commentnew2 will be created
+ resource "aws_api_gateway_resource" "commentnew2" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "2"
      + rest_api_id = "n1fiynim17"
    }

  # aws_api_gateway_stage.api will be updated in-place
~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "5ype87" -> "3irwgl"
        id                    = "ags-n1fiynim17-api"
        tags                  = {}
        # (9 unchanged attributes hidden)
    }

Plan: 15 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.weploy.com.br/lock?id=alsofer%252Fcomentarios-api-infra%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 15 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
